nxp-mcuxpresso/mcux-sdk/devices/LPC865/LPC865.h
#define SWM_FTM_PINASSIGN0_FTM1_CH1_MASK         (0xC000000U)
#define SWM_FTM_PINASSIGN0_FTM1_CH1_SHIFT        (26U)
/*! FTM1_CH1 - Assign movable function FTM1_CH1 */
#define SWM_FTM_PINASSIGN0_FTM1_CH1(x)           (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM1_CH1_SHIFT)) & SWM_FTM_PINASSIGN0_FTM1_CH1_MASK)

#define SWM_FTM_PINASSIGN0_FTM1_CH2_MASK         (0x30000000U)
#define SWM_FTM_PINASSIGN0_FTM1_CH2_SHIFT        (28U)
/*! FTM1_CH2 - Assign movable function FTM1_CH2 */
#define SWM_FTM_PINASSIGN0_FTM1_CH2(x)           (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM1_CH2_SHIFT)) & SWM_FTM_PINASSIGN0_FTM1_CH2_MASK)

#define SWM_FTM_PINASSIGN0_FTM1_CH3_MASK         (0xC0000000U)
#define SWM_FTM_PINASSIGN0_FTM1_CH3_SHIFT        (30U)
/*! FTM1_CH3 - Assign movable function FTM1_CH3 */
#define SWM_FTM_PINASSIGN0_FTM1_CH3(x)           (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM1_CH3_SHIFT)) & SWM_FTM_PINASSIGN0_FTM1_CH3_MASK)
/*! @} */

/*! @name FTM_PINASSIGN1 - FlexTimer Pin assign register 0 Assign movable functions. */
/*! @{ */

#define SWM_FTM_PINASSIGN1_FTM1_QD_PHA_MASK      (0x3U)
#define SWM_FTM_PINASSIGN1_FTM1_QD_PHA_SHIFT     (0U)
/*! FTM1_QD_PHA - Assign movable function FTM1_QD_PHA */
#define SWM_FTM_PINASSIGN1_FTM1_QD_PHA(x)        (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN1_FTM1_QD_PHA_SHIFT)) & SWM_FTM_PINASSIGN1_FTM1_QD_PHA_MASK)

#define SWM_FTM_PINASSIGN1_FTM1_QD_PHB_MASK      (0xCU)
#define SWM_FTM_PINASSIGN1_FTM1_QD_PHB_SHIFT     (2U)
/*! FTM1_QD_PHB - Assign movable function FTM1_QD_PHB */
#define SWM_FTM_PINASSIGN1_FTM1_QD_PHB(x)        (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN1_FTM1_QD_PHB_SHIFT)) & SWM_FTM_PINASSIGN1_FTM1_QD_PHB_MASK)
/*! @} */

/*! @name PINENABLE0 - Pin enable register 0. Enables fixed-pin functions ACMP_I0, ACMP_I1, SWCLK, SWDIO, XTALIN, XTALOUT, RESET, CLKIN, VDDCMP and so on. */
/*! @{ */

#define SWM_PINENABLE0_ACMP_I1_MASK              (0x1U)
#define SWM_PINENABLE0_ACMP_I1_SHIFT             (0U)
/*! ACMP_I1 - ACMP_I1 function select.
 *  0b0..ACMP_I1 enabled on pin PIO0_00.
 *  0b1..ACMP_I1 disabled.
 */
#define SWM_PINENABLE0_ACMP_I1(x)                (((uint32_t)(((uint32_t)(x)) << SWM_PINENABLE0_ACMP_I1_SHIFT)) & SWM_PINENABLE0_ACMP_I1_MASK)

#define SWM_PINENABLE0_ACMP_I2_MASK              (0x2U)
#define SWM_PINENABLE0_ACMP_I2_SHIFT             (1U)
/*! ACMP_I2 - ACMP_I2 function select.
 *  0b0..ACMP_I2 enabled on pin PIO0_1.
 *  0b1..ACMP_I2 disabled.
 */
#define SWM_PINENABLE0_ACMP_I2(x)                (((uint32_t)(((uint32_t)(x)) << SWM_PINENABLE0_ACMP_I2_SHIFT)) & SWM_PINENABLE0_ACMP_I2_MASK)

#define SWM_PINENABLE0_ACMP_I3_MASK              (0x4U)
#define SWM_PINENABLE0_ACMP_I3_SHIFT             (2U)
/*! ACMP_I3 - ACMP_I3 function select.
 *  0b0..ACMP_I3 enabled on pin PIO0_14.
 *  0b1..ACMP_I3 disabled.
 */
#define SWM_PINENABLE0_ACMP_I3(x)                (((uint32_t)(((uint32_t)(x)) << SWM_PINENABLE0_ACMP_I3_SHIFT)) & SWM_PINENABLE0_ACMP_I3_MASK)

#define SWM_PINENABLE0_ACMP_I4_MASK              (0x8U)
#define SWM_PINENABLE0_ACMP_I4_SHIFT             (3U)
/*! ACMP_I4 - ACMP_I4 function select.
 *  0b0..ACMP_I4 enabled on pin PIO0_23.
 *  0b1..ACMP_I4 disabled.
 */
#define SWM_PINENABLE0_ACMP_I4(x)                (((uint32_t)(((uint32_t)(x)) << SWM_PINENABLE0_ACMP_I4_SHIFT)) & SWM_PINENABLE0_ACMP_I4_MASK)

#define SWM_PINENABLE0_ACMP_I5_MASK              (0x10U)
#define SWM_PINENABLE0_ACMP_I5_SHIFT             (4U)
/*! ACMP_I5 - ACMP_I5 function select.
 *  0b0..ACMP_I5 enabled on pin PIO0_30.
 *  0b1..ACMP_I5 disabled.
 */
#define SWM_PINENABLE0_ACMP_I5(x)                (((uint32_t)(((uint32_t)(x)) << SWM_PINENABLE0_ACMP_I5_SHIFT)) & SWM_PINENABLE0_ACMP_I5_MASK)

#define SWM_PINENABLE0_SWCLK_MASK                (0x20U)
#define SWM_PINENABLE0_SWCLK_SHIFT               (5U)
/*! SWCLK - SWCLK function select.
 *  0b0..SWCLK enabled on pin PIO0_3.
 *  0b1..SWCLK disabled.
 */
#define SWM_PINENABLE0_SWCLK(x)                  (((uint32_t)(((uint32_t)(x)) << SWM_PINENABLE0_SWCLK_SHIFT)) & SWM_PINENABLE0_SWCLK_MASK)

#define SWM_PINENABLE0_SWDIO_MASK                (0x40U)
#define SWM_PINENABLE0_SWDIO_SHIFT               (6U)
/*! SWDIO - SWDIO function select.
 *  0b0..SWDIO enabled on pin PIO0_2.
 *  0b1..SWDIO disabled.
 */
#define SWM_PINENABLE0_SWDIO(x)                  (((uint32_t)(((uint32_t)(x)) << SWM_PINENABLE0_SWDIO_SHIFT)) & SWM_PINENABLE0_SWDIO_MASK)

#define SWM_PINENABLE0_RESETN_MASK               (0x80U)
#define SWM_PINENABLE0_RESETN_SHIFT              (7U)
/*! RESETN - RESETN function select.
 *  0b0..RESETN enabled on pin PIO0_5.
 *  0b1..RESETN disabled.
 */
#define SWM_PINENABLE0_RESETN(x)                 (((uint32_t)(((uint32_t)(x)) << SWM_PINENABLE0_RESETN_SHIFT)) & SWM_PINENABLE0_RESETN_MASK)

#define SWM_PINENABLE0_CLKIN_MASK                (0x100U)
#define SWM_PINENABLE0_CLKIN_SHIFT               (8U)
/*! CLKIN - CLKIN function select.
 *  0b0..CLKIN enabled on pin PIO0_1.
 *  0b1..CLKIN disabled.
 */
#define SWM_PINENABLE0_CLKIN(x)                  (((uint32_t)(((uint32_t)(x)) << SWM_PINENABLE0_CLKIN_SHIFT)) & SWM_PINENABLE0_CLKIN_MASK)

#define SWM_PINENABLE0_CMPVREF_MASK              (0x200U)
#define SWM_PINENABLE0_CMPVREF_SHIFT             (9U)
/*! CMPVREF - CMPVREF function select.
 *  0b0..CMPVREF enabled on pin PIO0_6.
 *  0b1..CMPVREF disabled.
 */
#define SWM_PINENABLE0_CMPVREF(x)                (((uint32_t)(((uint32_t)(x)) << SWM_PINENABLE0_CMPVREF_SHIFT)) & SWM_PINENABLE0_CMPVREF_MASK)

#define SWM_PINENABLE0_XTALIN_MASK               (0x400U)
#define SWM_PINENABLE0_XTALIN_SHIFT              (10U)
/*! XTALIN - XTALIN function select.
 *  0b0..XTALIN enabled on pin PIO0_8.
 *  0b1..XTALIN disabled.
 */
#define SWM_PINENABLE0_XTALIN(x)                 (((uint32_t)(((uint32_t)(x)) << SWM_PINENABLE0_XTALIN_SHIFT)) & SWM_PINENABLE0_XTALIN_MASK)

#define SWM_PINENABLE0_XTALOUT_MASK              (0x800U)
#define SWM_PINENABLE0_XTALOUT_SHIFT             (11U)
/*! XTALOUT - XTALOUT function select.
 *  0b0..XTALOUT enabled on pin PIO0_9.
 *  0b1..XTALOUT disabled.
 */
#define SWM_PINENABLE0_XTALOUT(x)                (((uint32_t)(((uint32_t)(x)) << SWM_PINENABLE0_XTALOUT_SHIFT)) & SWM_PINENABLE0_XTALOUT_MASK)

#define SWM_PINENABLE0_ADC_0_MASK                (0x1000U)
#define SWM_PINENABLE0_ADC_0_SHIFT               (12U)
/*! ADC_0 - ADC_0 function select.
 *  0b0..ADC_0 enabled on pin PIO0_7.
 *  0b1..ADC_0 disabled.
 */
#define SWM_PINENABLE0_ADC_0(x)                  (((uint32_t)(((uint32_t)(x)) << SWM_PINENABLE0_ADC_0_SHIFT)) & SWM_PINENABLE0_ADC_0_MASK)

